a = 38

print('Здравствуйте')
if a < 0:
    print('меньше нуля')

print('Досвидания')

a, b = 10, 5

if a > b:
    print('a > b')

if a > b and a > 0:
    print('успех')

if a > b and (a > 0 or b < 1000):
    print('большой успех')

if 5 < b and b < 10:
    print('очень большой успех')

if '34' > '123':
    print('успех1')

if '123' > '12':
    print('успех2')

if [1, 2] > [1, 1]:
    print('успех3')
# нельзя сравнивать:
# if 2 > [1, 1]:
#     print('успех')
#
# if 3 > '123':
#     print('успех')

if '34' != [1, 3]:
    print('общий успех')